export interface SchoolData {
  id: number;
  name: string;
  lat: number;
  lng: number;
  address: string;
  type: string;
  staffUsername?: string;
  staffPassword?: string;
}

export const SCHOOLS: SchoolData[] = [
  { id: 1, name: "إعدادية المحاميد 10", lat: 31.6320, lng: -8.0250, address: "جماعة سعاده، منطقة المحاميد، مقاطعة المنارة، مراكش", type: "إعدادية" },
  { id: 3, name: "إعدادية التقدم", lat: 31.591080, lng: -8.025128, address: "شارع بوعكاز، المحاميد، مراكش", type: "إعدادية" },
  { id: 4, name: "إعدادية المسيرة الثانية", lat: 31.594922, lng: -8.058176, address: "المسيرة، مقاطعة المنارة، مراكش", type: "إعدادية" },
  { id: 5, name: "إعدادية علال الفاسي", lat: 31.582895, lng: -8.056015, address: "منطقة المحاميد، مراكش", type: "إعدادية" },
  { id: 6, name: "إعدادية العربي بن صديق", lat: 31.588039, lng: -8.059008, address: "مراكش 40160", type: "إعدادية" },
  { id: 7, name: "إعدادية الضحى", lat: 31.585547, lng: -8.047863, address: "مراكش 40160", type: "إعدادية" },
  { id: 8, name: "إعدادية طارق بن زياد", lat: 31.592052, lng: -8.033955, address: "المحاميد 1، مراكش", type: "إعدادية" },
  { id: 9, name: "إعدادية إدريس بنزكري", lat: 31.601510, lng: -8.039750, address: "مقاطعة المنارة، مراكش", type: "إعدادية" },
  { id: 10, name: "إعدادية الأطلس", lat: 31.602719, lng: -8.051217, address: "شارع سجلماسة، مراكش", type: "إعدادية" },
  { id: 11, name: "إعدادية النهضة", lat: 31.596387, lng: -8.043653, address: "المحاميد، مراكش", type: "إعدادية" },
  { id: 12, name: "إعدادية غاندي", lat: 31.582706, lng: -8.032965, address: "منطقة المحاميد، مراكش", type: "إعدادية" },
  { id: 13, name: "إعدادية المحاميد 9", lat: 31.571060, lng: -8.058709, address: "المحاميد، مراكش 40160", type: "إعدادية" },
  { id: 14, name: "إعدادية يعقوب المنصور", lat: 31.615569, lng: -7.973241, address: "سيدي يوسف بن علي، مراكش", type: "إعدادية" },
  { id: 15, name: "إعدادية عمر بن الخطاب", lat: 31.615110, lng: -7.972089, address: "سيدي يوسف بن علي، مراكش", type: "إعدادية" },
  { id: 16, name: "ثانوية الفقيه محمد بنبين", lat: 31.597487, lng: -7.963890, address: "سيدي يوسف بن علي، مراكش", type: "إعدادية" },
  { id: 17, name: "إعدادية حمان الفطواكي", lat: 31.607548, lng: -7.957287, address: "سيدي يوسف بن علي، مراكش", type: "إعدادية" },
  { id: 18, name: "إعدادية الصفاء", lat: 31.606857, lng: -7.958125, address: "سيدي يوسف بن علي، مراكش", type: "إعدادية" },
  { id: 19, name: "إعدادية فاطمة الفهرية", lat: 31.608041, lng: -7.967248, address: "منطقة جيليز، مراكش", type: "إعدادية" },
  { id: 20, name: "إعدادية ابن العريف", lat: 31.605060, lng: -7.967291, address: "منطقة الداوديات، مراكش", type: "إعدادية" },
  { id: 21, name: "إعدادية المنفلوطي", lat: 31.618022, lng: -8.068141, address: "حي المنارة، مراكش", type: "إعدادية" },
  { id: 22, name: "إعدادية المختار السوسي", lat: 31.624270, lng: -8.050736, address: "حي آزلي، مراكش", type: "إعدادية" },
  { id: 23, name: "ملحقة ثانوية المختار السوسي الإعدادية", lat: 31.623964, lng: -8.051727, address: "حي آزلي، مراكش", type: "إعدادية" },
  { id: 24, name: "إعدادية آزلي", lat: 31.612925, lng: -8.053611, address: "حي آزلي، مراكش", type: "إعدادية" },
  { id: 25, name: "إعدادية جبل جليز", lat: 31.619470, lng: -8.056353, address: "حي بوكراع، مراكش", type: "إعدادية" },
  { id: 26, name: "إعدادية الشريف الإدريسي", lat: 31.619896, lng: -8.053062, address: "حي آزلي، مراكش", type: "إعدادية" },
  { id: 27, name: "إعدادية ابن تومرت", lat: 31.628574, lng: -8.047911, address: "شارع عبد الكريم الخطابي، مراكش", type: "إعدادية" },
  { id: 28, name: "إعدادية طه حسين", lat: 31.637645, lng: -8.068977, address: "طريق الدار البيضاء، مراكش", type: "إعدادية" },
  { id: 29, name: "إعدادية مولاي رشيد", lat: 31.639692, lng: -8.067029, address: "حي الداوديات، مراكش", type: "إعدادية" },
  { id: 30, name: "إعدادية لالة مريم", lat: 31.634079, lng: -8.018206, address: "شارع عبد الكريم الخطابي، مراكش", type: "إعدادية" },
  { id: 31, name: "ثانوية أبي العباس السبتي", lat: 31.645056, lng: -7.996906, address: "حي الداوديات، مراكش", type: "إعدادية" },
  { id: 32, name: "إعدادية وادي الذهب", lat: 31.652530, lng: -8.001959, address: "حي الداوديات، مراكش", type: "إعدادية" },
  { id: 33, name: "إعدادية لالة حسناء", lat: 31.653719, lng: -8.000145, address: "شارع بلال بن رباح، مراكش", type: "إعدادية" },
  { id: 34, name: "إعدادية الشرف", lat: 31.667832, lng: -8.024983, address: "حي الشرف، مراكش", type: "إعدادية" },
  { id: 35, name: "إعدادية الشاطبي", lat: 31.658825, lng: -7.975569, address: "اعدادية الشاطبي، مراكش", type: "إعدادية" },
  { id: 36, name: "إعدادية شاعر الحمراء", lat: 31.647796, lng: -7.989478, address: "حي الداوديات، مراكش", type: "إعدادية" },
  { id: 37, name: "إعدادية عبد المومن", lat: 31.636409, lng: -7.983591, address: "شارع أنطاكي، مراكش", type: "إعدادية" },
  { id: 38, name: "إعدادية أحمد شوقي", lat: 31.640805, lng: -7.984972, address: "باب الخميس، مراكش", type: "إعدادية" },
  { id: 39, name: "إعدادية ابن البناء المراكشي", lat: 31.620219, lng: -7.988896, address: "سيدي يوسف بن علي، مراكش", type: "إعدادية" },
  { id: 40, name: "إعدادية الفارابي", lat: 31.625025, lng: -7.980787, address: "حي بين القشالي، مراكش", type: "إعدادية" },
  { id: 41, name: "إعدادية الليمون", lat: 31.625393, lng: -7.977798, address: "زنقة باب أحمد، مراكش 40000", type: "إعدادية" },
  { id: 42, name: "ثانوية العودة السعدية", lat: 31.619297, lng: -7.990521, address: "قرب باب الدباغ، مراكش", type: "إعدادية" },
  { id: 43, name: "إعدادية محمد الخامس", lat: 31.634360, lng: -7.991435, address: "قصبة مراكش 40000", type: "إعدادية" },
  { id: 44, name: "إعدادية العيون", lat: 31.619297, lng: -7.990521, address: "حي سيدي ميمون، مراكش", type: "إعدادية" },
  { id: 45, name: "إعدادية المنصور الذهبي", lat: 31.617779, lng: -7.979883, address: "حي سيدي يوسف بن علي، مراكش", type: "إعدادية" },
  { id: 46, name: "إعدادية الكتبية", lat: 31.631336, lng: -7.999957, address: "مراكش 40000", type: "إعدادية" },
  { id: 47, name: "إعدادية فدوى طوقان", lat: 31.639779, lng: -8.079713, address: "مراكش", type: "إعدادية" },
  { id: 48, name: "إعدادية الإمام مالك", lat: 31.659383, lng: -8.006736, address: "شارع علال الفاسي، مراكش 40000", type: "إعدادية" },
  { id: 49, name: "إعدادية القدس", lat: 31.638606, lng: -8.051320, address: "مراكش 40130", type: "إعدادية" },
  { id: 50, name: "إعدادية البيروني", lat: 31.669965, lng: -8.023877, address: "مراكش", type: "إعدادية" },
  { id: 51, name: "إعدادية المجد", lat: 31.641300, lng: -8.018994, address: "كلية العلوم، مراكش 40000", type: "إعدادية" },
  { id: 52, name: "إعدادية الإمام علي", lat: 31.647588, lng: -7.977394, address: "مراكش 40000", type: "إعدادية" },
  { id: 53, name: "إعدادية النخيل", lat: 31.638709, lng: -8.007112, address: "شارع يعقوب المنصور، مراكش 40000", type: "إعدادية" }
];

export const MHAMID_CENTER = { lat: 31.6300, lng: -8.0250 };
export const GOOGLE_MAPS_API_KEY = "AIzaSyCFKTh5hUvvd2aePABMJifZpRngKD7Ido0";
